## 데이터 그룹핑

### groupby 함수

In [2]:
import numpy as np
import pandas as pd

In [3]:
# Data Frame 생성
df = pd.DataFrame({
    '학과': ['수학', '화학', '수학', '화학' ,'수학'],
    '이름': ['로버트', '앤드류', '유진', '제이슨', '제이크'],
    '학년': [1, 2, 3, 2, 3],
    '학점': [1.5, 2.7, 3.5, 1.9, 4.0]
})

display(df)

   학과   이름  학년   학점
0  수학  로버트   1  1.5
1  화학  앤드류   2  2.7
2  수학   유진   3  3.5
3  화학  제이슨   2  1.9
4  수학  제이크   3  4.0

In [8]:
# Data Frame에 대해 학과를 기준으로 그룹화 진행
df_dept = df.groupby('학과')

In [9]:
print(df_dept)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001540A687748>

In [10]:
# 그룹화한 그 자체로는 뭔가를 출력하거나 직접 사용할 수 없다. (SQL과 동일)
# 집계함수 등을 통해 용도에 맞게 활용
# 학과별 기술통계 출력
df_dept.describe()

      학년                                                 학점                 \
   count      mean       std  min  25%  50%  75%  max count mean       std
학과
수학   3.0  2.333333  1.154701  1.0  2.0  3.0  3.0  3.0   3.0  3.0  1.322876
화학   2.0  2.000000  0.000000  2.0  2.0  2.0  2.0  2.0   2.0  2.3  0.565685


    min  25%  50%   75%  max
학과
수학  1.5  2.5  3.5  3.75  4.0
화학  1.9  2.1  2.3  2.50  2.7

In [7]:
# 학과별 원소 개수 출력
df_dept.count()

    이름  학년  학점
학과
수학   3   3   3
화학   2   2   2

### 1단계 그룹핑

In [4]:
# Series에 대한 1단계 그룹핑
# 위에 df.groupby('학과') 는 DataFrameGroupBy 객체이며
# df['컬럼 1개']의 경우 series로 반환이 되므로
# df['학점'].groupby(df['학점']) 의 경우 SeriesGroupBy 객체임을 확인할 수 있다.
dept = df['학점'].groupby(df['학과']) 
print(dept)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000001540A66AA88>

In [5]:
# 학과 평균 성적 출력
dept.mean()

학과
수학    3.0
화학    2.3
Name: 학점, dtype: float64

In [6]:
# 학과 성적 표준편차 출력
dept.std()

학과
수학    1.322876
화학    0.565685
Name: 학점, dtype: float64

In [11]:
# group별 크기 출력
group_size = dept.size()
print(group_size)

학과
수학    3
화학    2
Name: 학점, dtype: int64